title: Remote Access Tool - AnyDesk Execution With Known Revoked Signing Certificate
id: 41f407b5-3096-44ea-a74f-96d04fbc41be
status: experimental
description: |
    Detects the execution of an AnyDesk binary with a version prior to 8.0.8.
    Prior to version 8.0.8, the Anydesk application used a signing certificate that got compromised by threat actors.
    Use this rule to detect instances of older versions of Anydesk using the compromised certificate
    This is recommended in order to avoid attackers leveraging the certificate and signing their binaries to bypass detections.
references:
    - https://www.bleepingcomputer.com/news/security/anydesk-says-hackers-breached-its-production-servers-reset-passwords/
    - https://anydesk.com/en/changelog/windows
author: Sai Prashanth Pulisetti, Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/08
tags:
    - attack.execution
    - attack.initial_access
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - Image|endswith: '\AnyDesk.exe'
        - Description: 'AnyDesk'
        - Product: 'AnyDesk'
        - Company: 'AnyDesk Software GmbH'
    selection_version:
        FileVersion|startswith:
            - '7.0.'
            - '7.1.'
            - '8.0.1'
            - '8.0.2'
            - '8.0.3'
            - '8.0.4'
            - '8.0.5'
            - '8.0.6'
            - '8.0.7'
    filter_main_uninstall:
        CommandLine|contains:
            - ' --remove'
            - ' --uninstall'
    condition: all of selection_* and not 1 of filter_main_*
falsepositives:
    - Unlikely
level: medium
Footer

sigma/rules/windows/process_creation/proc_creation_win_remote_access_tools_anydesk_revoked_cert.yml…
Main Sigma Rule Repository. Contribute to SigmaHQ/sigma development by creating an account on GitHub.

github.com
Conclusion

This pull request was a rewarding experience, and it was gratifying to see it successfully merged. It served as a reminder of the importance of continuous learning and staying updated with the latest security threats.

A special thanks to Nasreddine Bencherchali (Nextron Systems) for his invaluable contributions to this rule. His expertise and dedication greatly enhanced the effectiveness of the rule.

I look forward to making more contributions in the future and helping to make our digital world a safer place.
Security Operation Center
Cyber Security Awareness
Information Security
Threat Hunting
Anydesk

System Weakness
Published in System Weakness
7.3K followers
·
Last published 3 days ago

System Weakness is a publication that specialises in publishing upcoming writers in cybersecurity and ethical hacking space. Our security experts write to make the cyber universe more secure, one vulnerability at a time.
Sai Prashanth Pulisetti
Written by Sai Prashanth Pulisetti
162 followers
·
46 following

A security geek with 3 years of experience in various security tools and methodologies. I expedite analysing malware samples in both static & dynamic analysis.
Edit profile
No responses yet
Sai Prashanth Pulisetti
Sai Prashanth Pulisetti

